---
kind: type
id: T:Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment
source: html/b5528756-9d84-ab2f-5f66-b8cf1e9e3536.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment

Indicates whether a face of the solid analyzed by ExtrusionAnalyzer is fully aligned, partially aligned, or unaligned with faces of the extrusion.

## Syntax (C#)
```csharp
public enum ExtrusionAnalyzerFaceAlignment
```